In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [2]:
temp_db = create_engine('sqlite:///:memory:')

In [3]:
df = pd.DataFrame(data=np.random.randint(low=10,high=100,size=(4,4)),columns=['a','b','c','d'])

In [4]:
df

    a   b   c   d
0  77  90  79  26
1  62  49  18  11
2  84  21  72  98
3  70  22  25  79

In [5]:
df.to_sql(name='new_table',con=temp_db)

4

In [6]:
new_df = pd.read_sql(sql='new_table',con=temp_db)
new_df

   index   a   b   c   d
0      0  77  90  79  26
1      1  62  49  18  11
2      2  84  21  72  98
3      3  70  22  25  79

In [7]:
pd.read_sql_query(sql="select b,d from new_table where a=89",con=temp_db)

Empty DataFrame
Columns: [b, d]
Index: []